Documents/ЗаказМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаказМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.НарядЗаказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Материалы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТребуемыхМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Работа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единицы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Единицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПереченьТребуемыхМатериаловКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьТребуемыхМатериалов.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоимость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена
КонецПроцедуры

&НаСервере
Функция ПереченьТребуемыхМатериаловМатериалПриИзмененииНаСервере(Материал)
	ЦенаМатериала = РегистрМатериалыЦена.ПолучениеЦены(Материал);
	Возврат ЦенаМатериала;
КонецФункции

&НаКлиенте
Процедура ПереченьТребуемыхМатериаловМатериалПриИзменении(Элемент)
	Строка = Элементы.ПереченьТребуемыхМатериалов.ТекущиеДанные;
	ЦенаМатериала = ПереченьТребуемыхМатериаловМатериалПриИзмененииНаСервере(Строка.Материал);
	Строка.Цена = ЦенаМатериала;
	Строка.Стоимость = Строка.Цена * Строка.Количество;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Для каждого Строка из Объект.ПереченьТребуемыхМатериалов Цикл
		Строка.Цена = ПереченьТребуемыхМатериаловМатериалПриИзмененииНаСервере(Строка.Материал);
		Строка.Стоимость = Строка.Цена * Строка.Количество;
	КонецЦикла;
КонецПроцедуры
